{
  "ui": {
    "readingModeLabel": "पठन मोड",
    "languageLabel": "भाषा",
    "print": "प्रिंट",
    "modes": {
      "light": "लाइट",
      "sepia": "सेपिया",
      "dark": "डार्क",
      "contrast": "उच्च कंट्रास्ट"
    },
    "languages": {
      "pt": "पुर्तगाली",
      "en": "अंग्रेज़ी"
    }
  },
  "header": {
    "name": "Rodrigo Blefari Gonçalves",
    "title": "फ्रंट-एंड सॉफ्टवेयर इंजीनियर मिड/सीनियर | Angular | React",
    "location": "साओ पाउलो, ब्राज़ील",
    "contactLocationLabel": "नॉर्थ ज़ोन - SP",
    "phone": "+55 (11) 94820-5237",
    "email": "rodrigo.blefari@gmail.com",
    "linkedinLabel": "LinkedIn प्रोफाइल"
  },
  "sections": {
    "contact": "संपर्क",
    "keySkills": "मुख्य कौशल",
    "techSkills": "तकनीकी कौशल",
    "techProficiency": "प्रौद्योगिकियाँ और दक्षता",
    "education": "शैक्षणिक योग्यता",
    "summary": "व्यावसायिक सार",
    "experience": "व्यावसायिक अनुभव",
    "companies": "पिछली कंपनियाँ",
    "objective": "कैरियर लक्ष्य"
  },
  "categories": {
    "frontend": "फ्रंट-एंड",
    "backend": "बैक-एंड",
    "db": "डेटाबेस",
    "devops": "DevOps",
    "cicd": "CI/CD",
    "tools": "उपकरण",
    "apis": "API",
    "tests": "टेस्टिंग"
  },
  "proficiencyCategoriesOrder": [
    "frontend",
    "backend",
    "db",
    "devops",
    "cicd"
  ],
  "chipsCategoriesOrder": [
    "frontend",
    "tests",
    "backend",
    "db",
    "devops",
    "cicd",
    "apis",
    "tools"
  ],
  "keySkills": [
    "angular",
    "react",
    "typescript",
    "javascript",
    "html5",
    "css3",
    "nodejs",
    "react-native",
    "redux",
    "tailwind",
    "bootstrap",
    "graphql",
    "rest",
    "php",
    "mysql",
    "postgresql",
    "mongodb",
    "firebase",
    "github",
    "gitlab",
    "cypress",
    "jest",
    "karma",
    "jasmine",
    "testing-library",
    "playwright",
    "datadog",
    "fullstory",
    "ga4",
    "azure",
    "apache",
    "webpack",
    "vite",
    "babel",
    "wordpress",
    "laravel",
    "jquery"
  ],
  "summaryText": [
    "प्रौद्योगिकी के प्रति उत्साही वेब डेवलपर, जिनके पास कई स्टैक्स (Angular, React, TypeScript आदि) में मजबूत अनुभव है। मैंने विभिन्न आकार और क्षेत्रों की परियोजनाओं पर काम किया है, जहाँ सॉफ्टवेयर आर्किटेक्चर, स्वचालित परीक्षण (यूनिट और E2E), एक्सेसिबिलिटी, ऑब्ज़र्वेबिलिटी और एप्लिकेशन सुरक्षा की सर्वोत्तम प्रथाएँ लागू कीं। मैं एजाइल पद्धतियों (Scrum/Kanban), माइक्रो फ्रंटेंड, डिज़ाइन सिस्टम और मॉनिटरिंग टूल एकीकरण में भी अनुभवी हूँ। विकास से आगे बढ़कर, मैंने टीमों का नेतृत्व किया, भर्ती व प्रशिक्षण किया और इंजीनियरिंग की बेहतरीन प्रथाओं के माध्यम से व्यवसाय के लिए उच्च मूल्य की डिलीवरी सुनिश्चित की। ग्राहकों के साथ सीधे संपर्क में रहकर आवश्यकताओं को परिष्कृत करने और सफल केस स्टडीज़ के लिए दस्तावेज़ तैयार करने का अनुभव भी है। मैं बैक-ऑफिस प्लेटफ़ॉर्म और B2C उत्पादों दोनों में मूल्य जोड़ता हूँ, सुधार खोजने और MVP के दायरे पर चर्चा में सक्रिय रहता हूँ।",
    "अपने करियर के अधिकांश समय मैं फ़ुल स्टैक डेवलपर रहा हूँ, जहाँ परियोजनाओं के एंड-टू-एंड (360°) विकास, प्रबंधन और कार्यान्वयन की जिम्मेदारी संभाली है। मैं एप्लिकेशन के पूरे जीवनचक्र—आर्किटेक्चर और कोडिंग से लेकर परीक्षण, डिप्लॉयमेंट और रखरखाव—में अनुभव रखता हूँ। मेरे अनुभव में बड़ी कंपनियों में भूमिकाएँ और प्रसिद्ध ब्रांडों के फ्रीलांस प्रोजेक्ट शामिल हैं, जहाँ मैंने हमेशा इंजीनियरिंग, स्केलेबिलिटी और सुरक्षा की सर्वोत्तम प्रथाओं का पालन किया है। मुझमें नेतृत्व का गुण है, नई तकनीकों के प्रति जल्दी अनुकूल होता हूँ और उच्च प्रभाव वाली कुशल समाधान डिलीवर करने पर ध्यान केंद्रित करता हूँ।"
  ],
  "objectiveText": "वर्तमान में मैं JavaScript फ्रेमवर्क, विशेषकर Angular और React में अपने ज्ञान को और गहरा कर रहा हूँ, साथ ही समय-समय पर Node, Java, PHP, C# और डेटाबेस परियोजनाओं में योगदान देता हूँ। किसी भी भाषा को तेजी से ग्रहण करने की मेरी क्षमता और उत्कृष्टता के प्रति प्रतिबद्धता मुझे गतिशील चुनौतियों के लिए एक बहुमुखी और अनुकूल पेशेवर बनाती है।",
  "education": [
    {
      "title": "एसोसिएट डिग्री - कंप्यूटर प्रोग्रामिंग",
      "institution": "UNINOVE",
      "period": "2010 - 2013"
    },
    {
      "title": "ऑनलाइन कोर्स - प्रोग्रामिंग भाषाएँ",
      "institution": "W3Schools",
      "period": "2017 - 2018"
    },
    {
      "title": "प्रमाणपत्र - डेटाबेस",
      "institution": "Faculdade Impacta Tecnologia",
      "period": "2014"
    },
    {
      "title": "प्रमाणपत्र - Excel I और II",
      "institution": "Faculdade Impacta Tecnologia",
      "period": "2015 - 2016"
    },
    {
      "title": "प्रशिक्षण - Microsoft Azure (Fundamentals, Dev/Cloud)",
      "institution": "Microsoft | आंतरिक और ऑनलाइन कोर्स",
      "period": "2020 - 2021"
    },
    {
      "title": "प्रशिक्षण - Security Engineer II",
      "institution": "Itaú Unibanco",
      "period": "01/2025 - 08/2025"
    },
    {
      "title": "प्रशिक्षण - AWS Cloud Practitioner",
      "institution": "Itaú Unibanco",
      "period": "02/2025 - 08/2025"
    }
  ],
  "experience": [
    {
      "icon": "fas fa-laptop-code",
      "title": "आईटी इंजीनियरिंग विश्लेषक (मिड-लेवल) (TM)",
      "company": "Itaú Unibanco",
      "period": "अप्रैल 2024 - वर्तमान (1 वर्ष 6 माह)",
      "intro": "Itaú कंज़्यूमर ऐप (मासिक लाखों विज़िट) पर फ्रंटएंड सॉफ्टवेयर इंजीनियर के रूप में कार्यरत। मेरी यात्रा वेतन पोर्टेबिलिटी जर्नी से शुरू हुई, जहाँ मैंने मेट्रिक्स और डेटा के आधार पर एंड-टू-एंड फ्लो और सुधारों को डिज़ाइन किया, रिफ़ाइनमेंट, दस्तावेज़ीकरण और पूर्ण विकास का नेतृत्व किया, तथा ग्राहक-केंद्रित यात्राओं को यूनिट टेस्ट और आधुनिक डिज़ाइन सिस्टम के साथ एक मज़बूत समाधान में बदला।",
      "highlightsTitle": "मुख्य उपलब्धियाँ और जिम्मेदारियाँ:",
      "highlights": [
        "मान्यता: \"One Click\" जर्नी की डिलीवरी में योगदान; स्क्वाड को Journey of the Year से सम्मानित किया गया, जिसने कार्यकुशलता में 60% से अधिक सुधार लाकर लाखों उपयोगकर्ताओं को प्रभावित किया।",
        "डेटा विश्लेषण: मेट्रिक-चालित फ्लो, दस्तावेज़ीकरण, टेस्ट परिदृश्य और संपूर्ण फ्लोचार्ट तैयार किए।",
        "आर्किटेक्चर और विकास: WebView और माइक्रो फ्रंटेंड (Angular/React) पर काम करते हुए Voxel समाधानों को नए IDS (Itaú Design System) में विकसित किया।",
        "ऑब्ज़र्वेबिलिटी: Datadog, FullStory और GA4 को लागू किया तथा डैशबोर्ड और रणनीतिक मेट्रिक तैयार किए।",
        "गुणवत्ता और परीक्षण: Jest/Karma के साथ उच्च यूनिट टेस्ट कवरेज और Cypress के साथ E2E परीक्षण।",
        "जर्नी आर्किटेक्चर: वैल्यू स्ट्रीम में रणनीतिक बैठकों में सक्रिय भागीदारी।"
      ]
    },
    {
      "icon": "fas fa-plane",
      "title": "सीनियर सॉफ्टवेयर डेवलपमेंट इंजीनियर",
      "company": "Flytour Oficial",
      "period": "मार्च 2022 - नवंबर 2023 (1 वर्ष 9 माह)",
      "intro": "हवाई और स्थलीय यात्रा को कवर करने वाले ट्रैवल प्लेटफॉर्म में एंड-टू-एंड योगदान, जिसमें होटल, उड़ान, कार और अतिरिक्त सेवाओं की बुकिंग शामिल है। स्केलेबल, प्रतिक्रियाशील और उच्च प्रदर्शन इंटरफेस प्रदान करने के लिए Angular 2+ और React पर ध्यान केंद्रित। पुन: उपयोग योग्य कॉम्पोनेंट, CSS/SCSS लेआउट (डेस्कटॉप और मोबाइल) का अनुकूलन, तथा डेटाबेस और बैकएंड एकीकरण (REST/GraphQL APIs) जैसे महत्वपूर्ण क्षेत्रों का समर्थन किया। कोड रिव्यू, फ्रंटएंड आर्किटेक्चर, एक्सेसिबिलिटी और सुरक्षा की सर्वोत्तम प्रथाओं के अलावा डिप्लॉय, परीक्षण और मॉनिटरिंग में सहयोग में सक्रिय रहा। एजाइल विधियों, डिज़ाइन सिस्टम और उच्च उपयोग मात्रा वाली जटिल समाधानों के एकीकरण में गहरी सीख हासिल की।",
      "bullets": [
        "पुन: उपयोग योग्य कॉम्पोनेंट और CSS/SCSS लेआउट अनुकूलन (डेस्कटॉप और मोबाइल)।",
        "डेटाबेस और बैकएंड (REST/GraphQL APIs) के लिए समर्थन।",
        "कोड रिव्यू, फ्रंटएंड आर्किटेक्चर निर्णय, एक्सेसिबिलिटी और सुरक्षा प्रथाएँ।",
        "डिप्लॉय, परीक्षण और मॉनिटरिंग में सहयोग (एजाइल, डिज़ाइन सिस्टम)।"
      ]
    },
    {
      "icon": "fas fa-heartbeat",
      "title": "सीनियर एनालिस्ट प्रोग्रामर",
      "company": "Duosystem - Inteligência e Inovação em Saúde",
      "period": "मार्च 2020 - सितंबर 2021 (1 वर्ष 7 माह)",
      "intro": "SUS के लिए समाधान प्रदान करने पर केंद्रित हेल्थटेक, जो बेहद विश्वसनीय और ऑडिटेबल सिस्टम उपलब्ध कराती है तथा अंतिम उपयोगकर्ता की सुरक्षा पर जोर देती है। Symfony/Twig में फीचर्स, हॉटफिक्स और बग सुधार की जिम्मेदारी; फ्रंटएंड में Angular 2+, React, CSS, JS/jQuery और बैकएंड में Node.js तथा PHP/SQL। विश्लेषण और निदान से लेकर प्रोडक्शन डिलीवरी तक एंड-टू-एंड भागीदारी, जिससे गुणवत्ता, प्रदर्शन और प्रमुख आवश्यकताओं के अनुपालन को सुनिश्चित किया। Microsoft Azure के प्रशिक्षण और पाठ्यक्रमों ने तकनीकी वृद्धि और क्लाउड तैयारी को मजबूत किया।",
      "bullets": [
        "Symfony/Twig सिस्टम में फीचर, हॉटफिक्स और बग सुधार।",
        "फ्रंटएंड: Angular 2+, React, CSS, JS/jQuery; बैकएंड: Node.js, PHP/SQL।",
        "एंड-टू-एंड भागीदारी: विश्लेषण, ट्रबलशूटिंग और प्रोडक्शन डिलीवरी।",
        "Microsoft Azure प्रशिक्षण/कोर्स (तकनीकी विकास और क्लाउड तैयारी)।"
      ]
    },
    {
      "icon": "fas fa-globe",
      "title": "सीनियर फुल स्टैक PHP वेब डिज़ाइनर/प्रोग्रामर",
      "company": "ITWS - IT Web Solutions",
      "period": "सितंबर 2018 - मार्च 2020 (1 वर्ष 7 माह)",
      "intro": "React, Angular 2+, PHP (Yii2, Laravel), JavaScript, jQuery, Bootstrap, CSS, HTML, Ajax, MySQL, Apache तथा API/वेब सर्विस इंटीग्रेशन के साथ वेब विकास। फ्रंटएंड, बैकएंड और डेटाबेस में कस्टम ई-कॉमर्स समाधान पर ध्यान। ग्राहकों के साथ निकट सहयोग (आवश्यकताएँ, प्रतिस्पर्धी विश्लेषण, सुधार) और थर्ड-पार्टी टीमों को प्रशिक्षण।",
      "bullets": [
        "स्टैक: React, Angular 2+, PHP (Yii2, Laravel), JavaScript, jQuery, Bootstrap, CSS, HTML, Ajax, MySQL, Apache।",
        "कस्टम ई-कॉमर्स समाधान: फ्रंटएंड, बैकएंड और डेटाबेस में सुधार, अपडेट और संवर्धन।",
        "ग्राहक संपर्क (आवश्यकताएँ, प्रतिस्पर्धी विश्लेषण, सुधार) और बाहरी टीम प्रशिक्षण।"
      ]
    },
    {
      "icon": "fas fa-car",
      "title": "PHP डेवलपर",
      "company": "GT40",
      "period": "मार्च 2018 - अगस्त 2018 (6 माह)",
      "intro": "यहीं मैंने वास्तविक प्रोग्रामिंग सीखी; बिना फ्रेमवर्क के पूर्ण फुल स्टैक भूमिका निभाई। GT40 और Flatout (कार क्लासिफाइड) के लिए फ्रंटएंड, बैकएंड और डेटाबेस की देखभाल और विकास। API/वेब सर्विस विकास, लेआउट, HTML/CSS/JS/jQuery और Ajax, PHP, MySQL, PostgreSQL आधारित बैकएंड।",
      "bullets": [
        "GT40 और Flatout (फ्रंटएंड और बैकएंड) का रखरखाव और विकास।",
        "API/वेब सर्विस, HTML/CSS/JS/jQuery, Ajax, PHP, MySQL, PostgreSQL।"
      ]
    },
    {
      "icon": "fas fa-graduation-cap",
      "title": "वेब डेवलपर",
      "company": "Dominic 360",
      "period": "अप्रैल 2017 - मार्च 2018 (1 वर्ष)",
      "intro": "ई-लर्निंग साइट का फ्रीलांस प्रोजेक्ट।",
      "bullets": [
        "WordPress पर ई-लर्निंग प्लेटफ़ॉर्म (कस्टमाइजेशन, प्लगइन्स और थीम संपादन)।",
        "PHP, jQuery, JavaScript, MySQL, CSS3, HTML5 के साथ दैनिक समाधान।"
      ]
    },
    {
      "icon": "fas fa-user-tie",
      "title": "प्रशासनिक प्रबंधक",
      "company": "Associação Médica Brasileira",
      "period": "जुलाई 2012 - अक्टूबर 2017 (5 वर्ष 4 माह)",
      "intro": "सॉफ्ट स्किल्स का उल्लेखनीय विकास: जिम्मेदारी, शासन/राजनीतिक गतिशीलता तथा डॉक्टरों और पदानुक्रमों के साथ कार्य।",
      "bullets": [
        "प्रोजेक्ट/सिस्टम कार्यान्वयन प्रबंधन (आवश्यकताएँ, तकनीक, परीक्षण और उपयोगिता)।",
        "रिपोर्ट और सांख्यिकीय गणना (Excel)।",
        "नए कर्मचारियों का चयन, भर्ती और प्रशिक्षण।",
        "विदेशी डॉक्टरों के साथ अंग्रेज़ी में संवाद।"
      ]
    },
    {
      "icon": "fas fa-bullhorn",
      "title": "वेब डेवलपर",
      "company": "Trevisan MKT",
      "period": "जनवरी 2016 - फरवरी 2017 (1 वर्ष 2 माह)",
      "intro": "मार्केटिंग परामर्श जिसने विभिन्न उत्पादों के कार्यों को अनुकूल वेब समाधानों में परिवर्तित किया।",
      "bullets": [
        "क्लाइंट वेबसाइट परियोजनाएँ और रखरखाव (PHP, JavaScript, jQuery, CSS, HTML5, PostgreSQL, MySQL)।"
      ]
    }
  ],
  "companies": [
    "Itaú Unibanco",
    "Flytour",
    "Duosystem",
    "ITWS Group",
    "GT40",
    "Dominic 360",
    "AMB",
    "Trevisan MKT",
    "D360",
    "QUIDDE",
    "Vivo",
    "OpenTravel"
  ]
}
