{
  "ui": {
    "readingModeLabel": "Режим чтения",
    "languageLabel": "Язык",
    "print": "Печать",
    "modes": {
      "light": "Светлый",
      "sepia": "Сепия",
      "dark": "Тёмный",
      "contrast": "Высокий контраст"
    },
    "languages": {
      "pt": "Португальский",
      "en": "Английский"
    },
    "bannerBackground": "bg-globo-antigo.jpg"
  },
  "header": {
    "name": "Rodrigo Blefari Gonçalves",
    "title": "Инженер по фронтенд-разработке (Middle/Senior) | Angular | React",
    "location": "Сан-Паулу, Бразилия",
    "contactLocationLabel": "Северная зона — SP",
    "phone": "+55 (11) 94820-5237",
    "email": "rodrigo.blefari@gmail.com",
    "linkedinLabel": "Профиль LinkedIn"
  },
  "sections": {
    "contact": "Контакты",
    "keySkills": "Ключевые навыки",
    "techSkills": "Технические навыки",
    "techProficiency": "Технологии и уровень владения",
    "education": "Образование",
    "summary": "Профессиональное резюме",
    "experience": "Опыт работы",
    "companies": "Предыдущие компании",
    "objective": "Карьерная цель"
  },
  "categories": {
    "frontend": "Фронтенд",
    "backend": "Бэкенд",
    "db": "Базы данных",
    "devops": "DevOps",
    "cicd": "CI/CD",
    "tools": "Инструменты",
    "apis": "API",
    "tests": "Тестирование"
  },
  "proficiencyCategoriesOrder": [
    "frontend",
    "backend",
    "db",
    "devops",
    "cicd"
  ],
  "chipsCategoriesOrder": [
    "frontend",
    "tests",
    "backend",
    "db",
    "devops",
    "cicd",
    "apis",
    "tools"
  ],
  "keySkills": [
    "angular",
    "react",
    "typescript",
    "javascript",
    "html5",
    "css3",
    "nodejs",
    "react-native",
    "redux",
    "tailwind",
    "bootstrap",
    "graphql",
    "rest",
    "php",
    "mysql",
    "postgresql",
    "mongodb",
    "firebase",
    "github",
    "gitlab",
    "cypress",
    "jest",
    "karma",
    "jasmine",
    "testing-library",
    "playwright",
    "datadog",
    "fullstory",
    "ga4",
    "azure",
    "apache",
    "webpack",
    "vite",
    "babel",
    "wordpress",
    "laravel",
    "jquery"
  ],
  "summaryText": [
    "Веб-разработчик, увлеченный технологиями, с солидным опытом работы с несколькими стеками (Angular, React, TypeScript и др.). Участвовал в проектах различного масштаба и отраслей, применяя практики архитектуры ПО, автоматизированного тестирования (unit и E2E), доступности, наблюдаемости и безопасности приложений. Обладаю опытом в agile-методологиях (Scrum/Kanban), микрофронтендах, дизайн-системах и интеграции инструментов мониторинга. Помимо разработки, руководил командами, занимался наймом и обучением специалистов, обеспечивая лучшие инженерные практики и высокую ценность для бизнеса. Имею опыт прямого взаимодействия с клиентами: уточнение требований и подготовка документации для успешных кейсов. Приношу пользу как бэк-офисным системам, так и B2C-продуктам, активно выявляю улучшения и участвую в обсуждении MVP.",
    "На протяжении большей части карьеры работал Full Stack разработчиком, отвечая за разработку, управление и внедрение проектов end-to-end (360°). Знаю весь жизненный цикл приложения: архитектура и код, тестирование, деплой и сопровождение. В моем портфеле — опыт в крупных компаниях и фриланс-проекты для известных брендов; всегда применяю лучшие практики инженерии, масштабируемости и безопасности. Обладаю лидерскими качествами, быстро осваиваю новые технологии и сосредоточен на доставке эффективных, высокоэффективных решений."
  ],
  "objectiveText": "В настоящее время сосредоточен на углублении знаний в JavaScript-фреймворках, особенно Angular и React, периодически участвую в проектах на Node, Java, PHP, C# и с базами данных. Умение быстро вливаться в любую технологию и приверженность к качеству делают меня универсальным профессионалом, готовым к динамичным вызовам.",
  "education": [
    {
      "title": "Степень Associate — Программирование",
      "institution": "UNINOVE",
      "period": "2010 - 2013"
    },
    {
      "title": "Онлайн-курсы — Языки программирования",
      "institution": "W3Schools",
      "period": "2017 - 2018"
    },
    {
      "title": "Сертификат — Базы данных",
      "institution": "Faculdade Impacta Tecnologia",
      "period": "2014"
    },
    {
      "title": "Сертификат — Excel I и II",
      "institution": "Faculdade Impacta Tecnologia",
      "period": "2015 - 2016"
    },
    {
      "title": "Тренинг — Microsoft Azure (Fundamentals, Dev/Cloud)",
      "institution": "Microsoft | Внутренние и онлайн-курсы",
      "period": "2020 - 2021"
    },
    {
      "title": "Тренинг — Security Engineer II",
      "institution": "Itaú Unibanco",
      "period": "01/2025 - 08/2025"
    },
    {
      "title": "Тренинг — AWS Cloud Practitioner",
      "institution": "Itaú Unibanco",
      "period": "02/2025 - 08/2025"
    }
  ],
  "experience": [
    {
      "icon": "fas fa-laptop-code",
      "title": "Инженер-аналитик по ИТ (Middle) (TM)",
      "company": "Itaú Unibanco",
      "period": "Апрель 2024 - настоящее время (1 год 6 месяцев)",
      "intro": "Фронтенд-инженер, занимаюсь разработкой потребительского приложения Itaú, которым ежемесячно пользуются миллионы. Начал с направления портирования зарплат: отвечал за проектирование end-to-end потоков и улучшений на основе метрик и данных, возглавлял уточнение требований, документацию и полноценную разработку, превращая клиентские сценарии в надежное решение с unit-тестами и современной дизайн-системой.",
      "highlightsTitle": "Ключевые достижения и обязанности:",
      "highlights": [
        "Признание: участие в запуске джорни \"One Click\"; команда получила награду \"Journey of the Year\", повысив эффективность более чем на 60% и затронув миллионы пользователей.",
        "Аналитика: построение потоков, основанных на метриках, подготовка документации, тестовых сценариев и детальных схем.",
        "Архитектура и разработка: работа с WebView и микрофронтендами (Angular/React), развитие решений Voxel до нового IDS (Itaú Design System).",
        "Наблюдаемость: внедрение Datadog, FullStory и GA4 с дашбордами и стратегическими метриками.",
        "Качество и тестирование: высокая покрываемость unit-тестами (Jest/Karma) и E2E-тестирование Cypress.",
        "Архитектура пользовательских путей: активное участие в стратегических встречах на всем протяжении потока ценности."
      ]
    },
    {
      "icon": "fas fa-plane",
      "title": "Senior-разработчик программного обеспечения",
      "company": "Flytour Oficial",
      "period": "Март 2022 - Ноябрь 2023 (1 год 9 месяцев)",
      "intro": "Полное вовлечение в платформу путешествий (авиа и наземный транспорт), включающую бронирование отелей, перелетов, автомобилей и дополнительных сервисов. Основной фокус — Angular 2+ и React для создания масштабируемых, отзывчивых и высокопроизводительных интерфейсов. Отвечал за переиспользуемые компоненты, оптимизацию CSS/SCSS-макетов (desktop и mobile), поддержку интеграций с базами данных и бекэндом (REST/GraphQL API) и другие критически важные области. Активно участвовал в code review, архитектуре фронтенда, обеспечении доступности и безопасности, сотрудничал при деплоях, тестировании и мониторинге. Получил значительный опыт в agile-подходах, дизайн-системах и интеграции сложных решений для больших пользовательских аудиторий.",
      "bullets": [
        "Переиспользуемые компоненты и оптимизация CSS/SCSS-макетов (desktop и mobile).",
        "Поддержка баз данных и бекэнда (REST/GraphQL API).",
        "Code review, архитектурные решения на фронтенде, практики доступности и безопасности.",
        "Сотрудничество при деплоях, тестировании и мониторинге (agile, design systems)."
      ]
    },
    {
      "icon": "fas fa-heartbeat",
      "title": "Ведущий аналитик-программист",
      "company": "Duosystem - Inteligência e Inovação em Saúde",
      "period": "Март 2020 - Сентябрь 2021 (1 год 7 месяцев)",
      "intro": "Healthtech-компания, создающая решения для SUS: надежные, аудируемые системы с приоритетом безопасности пользователя. Отвечал за функциональность, хотфиксы и исправление багов в Symfony/Twig; фронтенд на Angular 2+, React, CSS, JS/jQuery; бекэнд на Node.js и PHP/SQL. Вовлечен end-to-end: от анализа и диагностики до вывода в продакшн, обеспечивая качество, производительность и соблюдение критичных требований. Прошел обучение и курсы Microsoft Azure, что значительно усилило техническую экспертизу и готовность к облаку.",
      "bullets": [
        "Функциональность, хотфиксы и исправление багов в системах на Symfony/Twig.",
        "Фронтенд: Angular 2+, React, CSS, JS/jQuery; бекэнд: Node.js, PHP/SQL.",
        "End-to-end участие: анализ, устранение проблем, релиз в продакшн.",
        "Обучение и курсы Microsoft Azure (развитие навыков и подготовка к облаку)."
      ]
    },
    {
      "icon": "fas fa-globe",
      "title": "Старший веб-дизайнер/программист PHP Full Stack",
      "company": "ITWS - IT Web Solutions",
      "period": "Сентябрь 2018 - Март 2020 (1 год 7 месяцев)",
      "intro": "Веб-разработка с использованием React, Angular 2+, PHP (Yii2, Laravel), JavaScript, jQuery, Bootstrap, CSS, HTML, Ajax, MySQL, Apache, а также интеграций API и веб-сервисов. Фокус на кастомных e-commerce решениях на фронтенде, бекэнде и уровне баз данных. Активно взаимодействовал с клиентами (сбор требований, конкурентный анализ, улучшения) и обучал команды подрядчиков.",
      "bullets": [
        "Стек: React, Angular 2+, PHP (Yii2, Laravel), JavaScript, jQuery, Bootstrap, CSS, HTML, Ajax, MySQL, Apache.",
        "Кастомные e-commerce решения: поддержка, обновления и улучшения фронтенда, бекэнда и базы данных.",
        "Прямое взаимодействие с клиентами (требования, конкурентный анализ, улучшения) и обучение сторонних команд."
      ]
    },
    {
      "icon": "fas fa-car",
      "title": "PHP-разработчик",
      "company": "GT40",
      "period": "Март 2018 - Август 2018 (6 месяцев)",
      "intro": "Именно здесь я по-настоящему освоил практическое программирование: никакие фреймворки, роль полного цикла. Поддержка и разработка фронтенда, бекэнда и базы данных для GT40 и Flatout (классифайды по автомобилям). Разработка API/веб-сервисов, верстка, HTML/CSS/JS/jQuery, а также бекэнд на Ajax, PHP, MySQL, PostgreSQL.",
      "bullets": [
        "Поддержка и разработка для GT40 и Flatout (фронтенд и бекэнд).",
        "API/веб-сервисы, HTML/CSS/JS/jQuery, Ajax, PHP, MySQL, PostgreSQL."
      ]
    },
    {
      "icon": "fas fa-graduation-cap",
      "title": "Веб-разработчик",
      "company": "Dominic 360",
      "period": "Апрель 2017 - Март 2018 (1 год)",
      "intro": "Фриланс-проект по созданию E-learning сайта.",
      "bullets": [
        "Платформа E-learning на WordPress с кастомизацией, плагинами и правкой тем.",
        "Ежедневные решения на PHP, jQuery, JavaScript, MySQL, CSS3, HTML5."
      ]
    },
    {
      "icon": "fas fa-user-tie",
      "title": "Административный менеджер",
      "company": "Associação Médica Brasileira",
      "period": "Июль 2012 - Октябрь 2017 (5 лет 4 месяца)",
      "intro": "Существенное развитие soft skills: ответственность, управление и политические процессы, взаимодействие с врачами и сложными иерархиями.",
      "bullets": [
        "Управление внедрением проектов/систем (требования, технологии, тесты и юзабилити).",
        "Отчеты и статистические расчеты (Excel).",
        "Подбор, найм и обучение новых сотрудников.",
        "Коммуникация на английском с иностранными врачами."
      ]
    },
    {
      "icon": "fas fa-bullhorn",
      "title": "Веб-разработчик",
      "company": "Trevisan MKT",
      "period": "Январь 2016 - Февраль 2017 (1 год 2 месяца)",
      "intro": "Маркетинговое агентство, передававшее разнообразные проекты для создания индивидуальных веб-решений.",
      "bullets": [
        "Проекты и поддержка сайтов клиентов (PHP, JavaScript, jQuery, CSS, HTML5, PostgreSQL, MySQL)."
      ]
    }
  ],
  "companies": [
    "Itaú Unibanco",
    "Flytour",
    "Duosystem",
    "ITWS Group",
    "GT40",
    "Dominic 360",
    "AMB",
    "Trevisan MKT",
    "D360",
    "QUIDDE",
    "Vivo",
    "OpenTravel"
  ]
}
